# ΜΑΘΗΜΑ: Επικοινωνία ανθρώπου-υπολογιστή

### Ονοματεπώνυμο: Λαρεντζάκης Νικόλαος
### Αριθμός Μητρώου: Π2018220

## ΕΡΓΑΣΙΑ 1

Για την πραγματοποίηση της εργασίας, αρχικά εγκατέστησα το Oracle VM Virtual Box και πάνω σε αυτό, το λειτουργικό Linux Ubuntu version 10.04.

Στη συνέχεια, εγκατέστησα τα απαιτούμενα εργαλεία:

:computer:    vi text editor

:computer:    asciinema όπου έκανα λογαριασμό για να μπορέσω να αποθηκεύσω αρχειο .cast

:computer:    neofetch για την προβολή του λειτουργικού και του hardware του συστήματός

:computer:    brew για την εγκατάσταση των εργαλείων


## ΠΑΡΑΔΟΤΕΟ 1

Παρακάτω δίνεται το link στο οποίο υπάρχει το .cast αρχείο στο οποίο φαίνονται οι ενέργειες που έκανα ώστε να υλοποιήσω τα ζητούμενα της εργασίας:
#### link στο site του asciinema: https://asciinema.org/a/273249
