---
author: epidrome
title: "Alan Kay"
image_url: /images/alan-kay.jpg
caption: "O Alan Kay οραματίστηκε το Dynabook και δημιούργησε λογισμικό που διευκολύνει τα παιδιά να μάθουν να σκέφτονται μαζί με τους υπολογιστές"
categories:
  - biography
  - definition
tags:
  - Alan Kay
  - Ivan Sutherland
  - Bret Victor
  - Dynabook
  - Smalltalk
  - Xerox Alto
gallery:
  - image_url: /images/dynabook.png
    caption: "Το Dynabook είναι ένα σχεδιαστικό όραμα του 1968 για ένα φορητό υπολογιστή τύπου τάμπλετ από τον Alan Kay που απευθύνεται σε παιδιά και μπορεί να προγραμματιστεί με στόχο την προσωπική έκφραση και την επεξεργασία της πληροφορίας"
  - image_url: /images/alan-kay.jpg
    caption: "Ο Αλαν Κεη συνδύασε γνώσεις και δεξιότητες από διαφορετικές περιοχές όπως οι υπολογιστές και τα μουσικά όργανα και έτσι μπόρεσε να φανταστεί τον υπολογιστή περισσότερο ως ένα μέσο επικοινωνίας και έκφρασης παρά ως ένα απλό εργαλείο."
  - image_url: /images/smalltalk.jpg
    caption: "Η αντικειμενοστραφής γλώσσα προγραμματισμού Smalltalk είχε έμφαση σε οντότητες υψηλού επιπέδου και στην διάδραση με τον χρήστη και έτσι διευκόλυνε την κατασκευή και τις δοκιμές του λογισμικού που τελικά οδήγησε στους πρώτους επιτυχημένους εμπορικά επιτραπέζιους υπολογιστές"
---

{% include_relative bio-kay.md %}

{% include slides.html caption="Εικόνες για την βιογραφία του Αλαν Κεη" %}
